In [1]:
import pandas as pd
import numpy as np

# Series

In [75]:
obj = pd.Series([4, 7, -5, 3])

In [76]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [77]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [78]:
s = obj.index   # returns a range

In [79]:
s

RangeIndex(start=0, stop=4, step=1)

In [80]:
for i in s: 
    print(i)

0
1
2
3

In [81]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [82]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [83]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

#### Indexing

In [84]:
obj2['a']

-5

In [90]:
obj2['d'] = 6

In [91]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

#### Numpy-Like Operation
    # Using NumPy functions or NumPy-like operations, such as filtering with a boolean
    array, scalar multiplication, or applying math functions, will preserve the index-value
    link

In [14]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [15]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [94]:
'b' in obj2

True

In [95]:
'e' in obj2

False

#### Series from python dictionary

In [96]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [97]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [98]:
obj3 = pd.Series(sdata)

In [99]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [101]:
obj3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [102]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [103]:
obj4 = pd.Series(sdata, index=states)

In [104]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [105]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [106]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [107]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [108]:
obj4.name = 'Population'

In [109]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [110]:
obj4.index.name = 'state'

In [111]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

# DataFrame

In [112]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
       }

In [113]:
frame = pd.DataFrame(data)

In [114]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [115]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [116]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [117]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [118]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [119]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [120]:
# Retrieving Columns

In [121]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [122]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [123]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [124]:
# Retriving Row

In [125]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [126]:
#Column Modifications

In [127]:
frame2['debt'] = 16.5

In [128]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [129]:
frame2['debt'] = np.arange(6.)

In [130]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [131]:
#Assigning series to a DataFrame

In [132]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [133]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [134]:
frame2['debt'] = val

In [135]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [136]:
# New Columns

In [143]:
frame2['eastern'] = frame2.state == 'Ohio'

In [144]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [145]:
del frame2['eastern']

In [146]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [147]:
#nested dict of dict Frame

In [64]:
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},
}

In [65]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [66]:
frame3 = pd.DataFrame(pop)

In [67]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [68]:
# Transposing

In [69]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [70]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [71]:
frame3.index.name = 'year'

In [72]:
frame3.columns.name = 'state'

In [73]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [148]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

# Index Objects

In [151]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [152]:
obj

a    0
b    1
c    2
dtype: int64

In [153]:
index = obj.index

In [154]:
index

Index(['a', 'b', 'c'], dtype='object')

In [155]:
index[1:]

Index(['b', 'c'], dtype='object')

In [157]:
labels = pd.Index(np.arange(3))

In [158]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [159]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [160]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [161]:
obj2.index is labels

True

In [216]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [217]:
labels.append(labels)

Int64Index([0, 1, 2, 0, 1, 2], dtype='int64')

In [189]:
labels

Int64Index([0, 1, 2], dtype='int64')

# Reindexing

In [190]:
obj = pd.Series([4.5, 2.4, -4.2, 4.0, -6.3], index=['d', 'b', 'a', 'c', 'e'])

In [191]:
obj

d    4.5
b    2.4
a   -4.2
c    4.0
e   -6.3
dtype: float64

In [193]:
obj.reindex(['a', 'b', 'c','d', 'e', 'f'])

a   -4.2
b    2.4
c    4.0
d    4.5
e   -6.3
f    NaN
dtype: float64

In [194]:
# ffill()

In [200]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=range(0, 5, 2))

In [201]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [221]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

Reindexing with Dataframe

In [222]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [223]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [224]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [225]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [226]:
#Reindexing Columns

In [227]:
states = ['Texas', 'Utah', 'California']

In [228]:
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0